FKDD_COPY_DIFF_3_2026-02-14/InformationRegisters/БТ_СтатусыЗаявкиДДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>БТ_СтатусыЗаявкиДДС</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.БТ_СтатусыЗаявки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЗаявкаДДС</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаРасходДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/InformationRegisters/БТ_СтатусыЗаявкиДДС/Ext/ManagerModule.bsl
Процедура УстановитьСтатус(ЗаявкаДДС, Статус, Дата = Неопределено) Экспорт
	
	Если Дата = Неопределено Тогда
		
		Дата = ТекущаяДата();
		
	КонецЕсли;
	
	МенеджерЗаписей = РегистрыСведений.БТ_СтатусыЗаявкиДДС.СоздатьМенеджерЗаписи();
	МенеджерЗаписей.ЗаявкаДДС 	= ЗаявкаДДС;
	МенеджерЗаписей.Статус 		= Статус;
	МенеджерЗаписей.Период		= Дата;
	МенеджерЗаписей.Записать();
	
КонецПроцедуры       

Функция УзнатьТекСтатус(ЗаявкаДДС) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	БТ_СтатусыЗаявкиДДССрезПоследних.Статус КАК Статус
		|ИЗ
		|	РегистрСведений.БТ_СтатусыЗаявкиДДС.СрезПоследних(, ЗаявкаДДС = &ЗаявкаДДС) КАК БТ_СтатусыЗаявкиДДССрезПоследних";
	
	Запрос.УстановитьПараметр("ЗаявкаДДС", ЗаявкаДДС);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		Возврат ВыборкаДетальныеЗаписи.Статус;
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции
